{"news":[{"id":"1743422200612-0","title":"The Best Altcoins to Avoid a Market Crash Following Trump’s US Tariffs on Liberation Day","description":"The crypto market is exhibiting clear signs of distress as the threats of several new US tariffs loom on April 2 – but this doesn’t mark the end of the best altcoins on presale. Running up to ‘Liberation Day,’ Trump hasn’t even answered some of the most fundamental questions, like which tariffs and what rates? […]","url":"https://bitcoinist.com/best-altcoins-amid-us-tariffs-on-liberation-day/","date":"Unknown"},{"id":"1743422200612-1","title":"Is Panama About to Become LATAM’s New Crypto Republic? Everything to Know About the Crypto Regulation Bill","description":"The Panama crypto bill aims to legalize voluntary crypto payments and attract blockchain firms, possibly with more tax incentives. Could this make Panama a LATAM crypto hub? Amid heated debates over the control of the Panama Canal and whether Chinese operators threaten U.S. national security, other key developments are unfolding in Panama. Top Panama news.. The post Is Panama About to Become LATAM’s New Crypto Republic? Everything to Know About the Crypto Regulation Bill appeared first on 99Bitcoins.","url":"https://99bitcoins.com/news/is-panama-about-to-become-latams-new-crypto-republic-everything-to-know-about-the-crypto-regulation-bill/","date":"Unknown"},{"id":"1743422200612-2","title":"Bitcoin Price Targets March Close: Will BTC/USD Finish March Green?","description":"Bitcoin price is under selling pressure from tariffs and inflation fears. Will BTC/USD close March green? Explore why prices are down and why the BTC Bull presale is gaining traction. After Bitcoin posted three consecutive days of losses, market participants expected a reprieve. However, that doesn’t seem to be the case. At press time, the.. The post Bitcoin Price Targets March Close: Will BTC/USD Finish March Green? appeared first on 99Bitcoins.","url":"https://99bitcoins.com/news/bitcoin-price-targets-march-close-will-btc-usd-finish-march-green/","date":"Unknown"},{"id":"1743422200612-3","title":"Cartesi Founder: Optimistic Rollups Remain Crucial to Ethereum Scaling, Despite Fading Hype","description":"Optimistic Rollups remain a crucial scaling solution for layer one blockchains, despite the recent hype around newer technologies. Industry experts, including Cartesi co-founder Felipe Argento, emphasize optimistic rollups’ continued dominance in the layer-two (L2) landscape. Optimistic Rollups Fundamental to Multi-Layer Blockchain Infrastructure Optimistic Rollups (OR), once hailed as a revolutionary scaling solution for layer one […]","url":"https://news.bitcoin.com/cartesi-founder-optimistic-rollups-remain-crucial-to-ethereum-scaling-despite-fading-hype/","date":"Unknown"},{"id":"1743422200612-4","title":"Will Telegram Integration Save Pi Network Price or Is xAI Linked TON Crypto A Better Hold?","description":"While Pi Network (PI crypto) has been integrated with Telegram for nearly a week, it hasn’t helped to break PI out of its ongoing downtrend. It has been down nearly 30% in the past seven days and has been down by -70% since the beginning of March. The unrelenting sell pressure for PI is leading.. The post Will Telegram Integration Save Pi Network Price or Is xAI Linked TON Crypto A Better Hold? appeared first on 99Bitcoins.","url":"https://99bitcoins.com/news/presales/will-telegram-integration-save-pi-network-price-or-is-xai-linked-ton-crypto-a-better-hold/","date":"Unknown"},{"id":"1743422200612-5","title":"New Crypto BTC Bull Token Heats Up as Saylor’s Moves Pressure S&P 500 to Buy More Bitcoin","description":"Elliot Chun, a partner at the tech-focused financial advisory firm Architect Partners, forecasts that by 2030, one in four S&amp;P 500 companies will have Bitcoin on their balance sheets. Radical prediction? Only two S&amp;P companies currently own Bitcoin – Tesla and Block. But with more and more companies setting themselves up as Bitcoin treasuries – […]","url":"https://bitcoinist.com/new-crypto-btc-bull-token-heats-up-saylor-sp500/","date":"Unknown"},{"id":"1743422200612-6","title":"‘A Safer Bet’—BlackRock CEO Issues Huge $952 Billion Bitcoin Price Warning To The U.S. Dollar","description":"The chief executive of the world’s largest asset manager BlackRock has warned bitcoin could be “eating away” at the U.S. dollar’s world’s reserve currency status...","url":"https://www.forbes.com/sites/digital-assets/2025/03/31/a-safer-bet-blackrock-ceo-issues-huge-952-billion-bitcoin-price-warning-to-the-us-dollar/","date":"Unknown"},{"id":"1743422200612-7","title":"Is The S&P 500 Adopting Bitcoin? 25% Of Firms Will Bid By 2030","description":"Bitcoin’s journey from a niche digital currency to a corporate asset is picking up speed. Elliot Chun, a partner at Architect Partners, predicts that by 2030, one in four S&amp;P 500 companies will add Bitcoin to their balance sheets. That’s a bold claim, but recent trends suggest it’s not far-fetched. Companies like Strategy (formerly MicroStrategy).. The post Is The S&amp;P 500 Adopting Bitcoin? 25% Of Firms Will Bid By 2030 appeared first on 99Bitcoins.","url":"https://99bitcoins.com/news/is-the-sp-500-adopting-bitcoin-25-of-firms-will-bid-by-2030/","date":"Unknown"},{"id":"1743422200612-8","title":"Crypto funds see $226M of inflows, but asset values slump — CoinShares","description":"Cryptocurrency exchange-traded products (ETPs) continued to see modest inflows last week, extending a reversal from a record-breaking streak of outflows.Global crypto ETPs posted another $226 million in inflows in the last trading week, adding to the prior week’s $644 million inflows, CoinShares reported on March 31.Despite the two-week positive trend after a five-week outflow streak, total assets under management (AUM) continued to decline, dropping below $134 million by March 28.Weekly crypto ETP flows since late 2024. Source: CoinSharesLast week’s inflows suggest positive but cautious investor behavior amid core Personal Consumption Expenditures in the US coming in above expectations, CoinShares’ head of research James Butterfill said.Bitcoin leads weekly inflowsBitcoin (BTC) investment products attracted the majority of inflows, totaling $195 million for the week, while short-BTC investment products saw outflows for the fourth consecutive week, totaling $2.5 million.Altcoins, in aggregate, saw their first week of inflows totaling $33 million, following four consecutive weeks of outflows totaling $1.7 billion.Flows by asset (in millions of US dollars). Source: CoinSharesAmong individual altcoins, Ether (ETH) saw $14.5 million in inflows. Solana (SOL), XRP (XRP) and Sui (SUI) followed with $7.8 million, $4.8 million and $4 million, respectively.AUM drops to lowest level in 2025 amid price slumpDespite recent inflows, crypto ETPs have failed to trigger a reversal in terms of total AUM.Since March 10, the total crypto ETP AUM dropped 5.7% from 142 billion, amounting to 133.9 billion as of March 28, the lowest level in 2025.Related: BlackRock to launch Bitcoin ETP in Europe — ReportAccording to CoinShares’ Butterfill, the AUM decline could be attributed to a slump in cryptocurrency prices.“Recent price falls have pushed Bitcoin global ETP’s total assets under management to their lowest level since just after the US election at $114 billion,” Butterfill wrote.Bitcoin price chart since Jan. 1, 2025. Source: CoinGeckoSince Jan. 1, 2025, the BTC price has dropped 13.6%, while the total market capitalization has tumbled nearly 20%, according to data from CoinGecko. Magazine: Bitcoin ATH sooner than expected? XRP may drop 40%, and more: Hodler’s Digest, March 23 – 29","url":"https://cointelegraph.com/news/crypto-etp-aum-falling-despite-226-million-inflows-coinshares?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound","date":"Unknown"},{"id":"1743422200612-9","title":"Metaplanet issues $13.3 million in new bonds to buy more bitcoin as Nikkei dips 4%","description":"Metaplanet issued $13.3 million in new debt to buy more bitcoin, though its stock and Japan's Nikkei dipped ahead of Trump's liberation day tariffs.","url":"https://www.theblock.co/post/348840/metaplanet-issues-13-3-million-in-new-bonds-to-buy-more-bitcoin-as-nikkei-dips-4?utm_source=rss&utm_medium=rss","date":"Unknown"},{"id":"1743422200612-10","title":"Japan to Reportedly Classify Crypto as Financial Products","description":"Coinspeaker Japan to Reportedly Classify Crypto as Financial Products Japan is aiming to regulate cryptocurrencies as financial products by 2026, redefining them as investment assets rather than settlement instruments. Japan to Reportedly Classify Crypto as Financial Products","url":"https://www.coinspeaker.com/japan-to-classify-crypto-as-financial-products/","date":"Unknown"},{"id":"1743422200612-11","title":"Altcoins see inflows for first time in 5 weeks as ‘positive but cautious’ investors add $226 million to global crypto funds: CoinShares","description":"Bitcoin investors added $195 million to global products while altcoin-based funds saw net inflows for the first time in five weeks.","url":"https://www.theblock.co/post/348836/positive-but-cautious-investors-add-226-million-usd-global-crypto-funds-coinshares?utm_source=rss&utm_medium=rss","date":"Unknown"},{"id":"1743422200612-12","title":"Dogecoin Not Part of Elon Musk’s D.O.G.E, Will Meme Coin Crash?","description":"Coinspeaker Dogecoin Not Part of Elon Musk’s D.O.G.E, Will Meme Coin Crash? During a town hall meeting, Elon Musk confirmed that Dogecoin has no connection to the Department of Government Efficiency (D.O.G.E), despite speculation. Dogecoin Not Part of Elon Musk’s D.O.G.E, Will Meme Coin Crash?","url":"https://www.coinspeaker.com/dogecoin-not-part-of-elon-musks-d-o-g-e-will-meme-coin-crash/","date":"Unknown"},{"id":"1743422200612-13","title":"Trump sons back new Bitcoin mining venture with Hut 8","description":"Several members of US President Donald Trump’s family are backing a new venture to launch what aims to become the world’s largest Bitcoin mining firm.Hut 8, a digital asset mining and infrastructure company, announced on March 31 that it is acquiring a majority stake in American Bitcoin, formerly known as American Data Center. The firm was founded by a group of investors including Trump’s sons, Donald Trump Jr. and Eric Trump.Related: Bitcoin miner Hut 8 argues to toss ‘short and distort’ shareholder suitAs part of the deal, American Bitcoin will take ownership of Hut 8’s Bitcoin (BTC) mining hardware. Donald Trump Jr. said that the entrepreneurs behind American Data Centers have personally backed their conviction in Bitcoin and through business.The new venture “aims to become the world’s largest, most efficient pure-play Bitcoin miner while building a robust strategic Bitcoin reserve.” Mining operations will remain under Hut 8’s compute segment but will operate through the American Bitcoin brand.“Mining it on favorable economics opens an even bigger opportunity. We’re excited to bring investors into that equation through a platform engineered to execute on this thesis and deliver real, tangible participation in Bitcoin’s growth.”Related: Hut 8 tips 66% hashrate boost after deal to buy 31K Bitcoin minersStrategic shift for Hut 8Hut 9 CEO Asher Genoot recognized the launch of American Bitcoin as a “pivotal evolution” in the firm‘s strategy. He said that by separating the mining business from the rest of the corporate activities and allowing it to raise its own capital and “align each segment of the business with its respective cost of capital.” He added:“It evolves Hut 8 toward more predictable, financeable, lower-cost-of-capital segments and establishes American Bitcoin as a pure-play mining platform built for exahash growth, Bitcoin production, and operating leverage.”The report follows Hut 8 surpassing $1 billion worth of Bitcoin holdings after acquiring 990 BTC for $100 million at the end of 2024. At the time, the company’s total Bitcoin mining stood at 10,096 BTC acquired at an average price of $24,484 per Bitcoin.Magazine: Bitcoin ATH sooner than expected? XRP may drop 40%, and more: Hodler’s Digest, March 23 – 29","url":"https://cointelegraph.com/news/trump-family-hut8-launch-bitcoin-mining-firm?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound","date":"Unknown"},{"id":"1743422200612-14","title":"Metaplanet to Issue More Debt to Buy Bitcoin at Discount","description":"Coinspeaker Metaplanet to Issue More Debt to Buy Bitcoin at Discount Metaplanet Inc’s board of directors approved bond issuance worth $13.33 million to buy Bitcoin. Metaplanet to Issue More Debt to Buy Bitcoin at Discount","url":"https://www.coinspeaker.com/metaplanet-to-issue-more-debt-to-buy-bitcoin-at-discount/","date":"Unknown"},{"id":"1743422200612-15","title":"How to file crypto taxes in the US (2024–2025 tax season)","description":"Key takeawaysUS crypto investors must file their 2024 tax returns by April 15, 2025, ensuring all crypto transactions are accurately reported to the IRS.Crypto held for less than a year is taxed as ordinary income (10%-37%), while holdings over a year qualify for lower capital gains rates (0%, 15%, or 20%).Selling, trading, or spending crypto triggers taxes, while holding or transferring between wallets does not.Mining, staking, airdrops, and crypto payments are taxed as income at applicable rates.The world of cryptocurrencies can indeed be an exciting space for investors, but as the tax season approaches, many US investors find themselves grappling with confusion and uncertainty. With the upcoming tax filing deadline of April 15, 2025, it’s a critical time to get a handle on crypto tax obligations. Ask most US crypto investors, and they’ll likely tell you that figuring out what transactions trigger a taxable event feels like navigating a maze.Understanding various aspects of tax filing is crucial for accurately filing taxes, avoiding penalties and staying compliant with the Internal Revenue Service (IRS). This article breaks down key elements like tax brackets, rates, exemptions and other critical details. How does the IRS tax crypto?The Internal Revenue Service, the agency responsible for collecting US federal taxes, treats cryptocurrencies as property for tax purposes. You pay taxes on gains realized when selling, trading or disposing of cryptocurrencies. For short-term capital gains (held less than a year), you pay taxes at the rates of 10%–37%, depending on your income bracket. Long-term capital gains (assets held for over a year) benefit from reduced rates of 0%, 15% or 20%, also based on your taxable income.When you dispose of cryptocurrency for more than its purchase price, you generate a capital gain. Conversely, selling below the purchase price results in a capital loss. You must report both your capital gains and losses for the year in which the transaction occurs, with gains being taxable and losses potentially offsetting gains to reduce your tax liability. With the upcoming April 15, 2025, deadline for filing 2024 tax returns, US crypto investors need to ensure these transactions are accurately tracked and reported.To illustrate, suppose you purchased Ether (ETH) worth $1,000 in 2023 and sold it after a year in 2024 for $1,200, netting a $200 profit. The IRS would tax that $200 as a long-term capital gain, applying the appropriate rate based on your 2024 income.Taxes are categorized as capital gains tax or income tax, depending on the type of transactions:Capital gains tax: Applies to selling crypto, using crypto to purchase goods or services, or trading one cryptocurrency for another.Income tax: Applies to crypto earned through mining, staking, receiving it as payment for work, or referral bonuses from exchanges.These distinctions are crucial for accurate reporting by the April 15 deadline. Gains are taxed, while losses can help offset taxable income, so detailed record-keeping is a must.Did you know? In Australia, gifting cryptocurrency triggers a capital gains tax (CGT) event. The giver may need to report gains or losses based on the asset’s market value at the time of transfer, though certain gifts — like those between spouses — may qualify for exemptions. While this differs from US rules, it highlights how crypto taxation varies globally.How crypto tax rates work in the USIn the US, your crypto tax rate depends on your income and how long you’ve held the cryptocurrency. Long-term capital gains tax rates range from 0% to 20%, and short-term rates align with ordinary income tax rates of 10%–37%. Transferring crypto between your own wallets or selling it at a loss doesn’t trigger a tax liability.You only owe taxes when you sell your crypto, whether for cash or for any other cryptocurrency. Consider this example: Suppose you bought crypto for $1,000 in 2024, and by 2025, its value rose to $2,000. If you don’t sell, no tax is due — unrealized gains aren’t taxable.If you sell cryptocurrency after holding it for a year or less, your profits are subject to short-term capital gains tax. These gains are taxed as ordinary income, meaning they are added to your total taxable earnings for the year. Tax rates are progressive, based on income brackets, so different portions of your income are taxed at different rates. For instance, a single filer in 2025 pays 10% on the first $11,000 of taxable income and 12% on income up to $44,725. Short-term rates are higher than long-term rates, so timing your sales can significantly impact your tax bill.Understanding crypto capital gains tax in the USIf you sell cryptocurrency after holding it for a year or less, your profits are subject to short-term capital gains tax. These gains are treated as ordinary income and added to your total taxable earnings for the year. Since tax rates are based on income brackets, different portions of your earnings are taxed at different rates, as explained above. 2024–2025 federal income tax brackets for crypto earningsHere are the federal income tax rates for the 2024–2025 tax year. You apply the 2024 tax brackets to income earned in the 2024 calendar year, reported on tax returns filed in 2025.Long-term capital gains tax for crypto earned in 2024You pay long-term capital gains tax if you sell cryptocurrency after holding it for more than a year. Unlike short-term gains, these aren’t taxed as ordinary income. Instead, tax rates are based on your total taxable income and filing status. Long-term capital gains tax rates are 0%, 15% or 20%, making them lower than short-term rates. Holding crypto longer can reduce your tax burden significantly.Here is a table outlining long-term crypto capital gains tax for the calendar year 2024. These rates are applicable when filing tax returns in 2025.2024–2025 standard deduction: Reduce your crypto taxable incomeThe standard deduction is the portion of your income that’s exempt from federal taxes before tax rates are applied, reducing your taxable income.Here is a table regarding tax deductions in the calendar year 2024. These amounts are applicable when filing for tax returns in 2025.How are crypto airdrops taxed in the US?In the US, crypto airdrops are treated as ordinary income by the IRS and taxed at the time they come under the taxpayer’s full control. The taxable amount is based on the tokens’ fair market value at that moment, even if the taxpayer didn’t request them. Later, selling or trading those tokens may trigger capital gains tax, depending on the price difference between receipt and disposal.The taxable event hinges on control: If tokens automatically appear in a taxpayer’s wallet, the income is typically recognized upon arrival. If the tokens require manual claiming (e.g., through a transaction), the taxable event occurs when the claim is completed. Either way, the fair market value at that point determines the income reported.When the taxpayer sells or trades the airdropped tokens, they incur a capital gain or loss, calculated as the difference between the value at receipt (the basis) and the value at sale or trade. Moreover, the holding periods matter: If sold within a year, gains are taxed at ordinary income rates (10%–37%, based on income brackets). If held longer than a year, gains qualify for lower long-term capital gains rates (0%, 15% or 20%, depending on income). Proper tracking of receipt dates and values is essential for accurate tax reporting.Crypto gifting rules and tax implications in the USIn the US, gifting cryptocurrency is generally not a taxable event for either the giver or the recipient, meaning no immediate tax is owed. However, specific thresholds and reporting requirements must be followed to stay compliant with IRS rules. For the 2024 tax year (filed by April 15, 2025), if the total value of crypto gifts to a single recipient exceeds $18,000, the giver must file a gift tax return using Form 709. When the recipient eventually sells the gifted cryptocurrency, they’ll calculate capital gains or losses based on the giver’s original cost basis — the price the giver paid for the crypto. If this cost basis isn’t documented or available, the recipient may need to assume a basis of $0, which could increase their taxable gain upon sale. To avoid complications, both parties should keep detailed records of the gift’s fair market value at the time of transfer and the giver’s original cost basis.Did you know? In the UK, giving cryptocurrency as a gift may result in capital gains tax for the giver, except for gifts to spouses or civil partners. Additionally, inheritance tax could apply if the giver dies within seven years of the gift.Essential forms for filing crypto taxes in 2024With the April 15, 2025, deadline nearing, here are the key forms for reporting 2024 crypto transactions:Form 8949: For reporting capital gains and losses from crypto sales, trades and disposals. Each transaction must be listed individually.Schedule D (Form 1040): Summarizes total capital gains and losses from Form 8949; used for calculating taxable income.Schedule 1 (Form 1040): Reports additional income, including staking rewards, airdrops and hard forks, if classified as taxable income.Schedule C (Form 1040): Used by self-employed individuals or businesses to report crypto-related income from mining, consulting or freelance work.Form 1099-MISC: Issued for staking, mining or payment income over $600Form 1040: The main return form to combine income, deductions and tax liability.FBAR (FinCEN Form 114): File separately if foreign crypto accounts exceeded $10,000 in 2024.Step-by-step guide to filing crypto taxes for the 2024–2025 tax seasonHere’s how to file, step by step, leveraging the detailed tax rates and forms outlined above.Step 1: Gather all crypto transaction recordsCollect records for every 2024 crypto transaction:Dates of buying, selling, trading or receiving cryptoAmounts (e.g., 0.5 Bitcoin) and US dollar fair market value (FMV) at the timeCost basis (what you paid, including fees) and proceeds (what you received).To ensure complete records, pull data from wallets, exchanges (e.g., Coinbase) and blockchain explorers. Export transaction histories or CSVs, and note staking rewards, airdrops or mining income separately with their FMV on receipt.Step 2: Identify taxable eventsPinpoint which 2024 actions trigger taxes:Taxable: Selling crypto for cash/stablecoins, trading crypto, spending crypto or earning it (mining, staking, airdrops).Non-taxable: Buying and holding with USD, moving crypto between your wallets, gifting up to $18,000 per recipient.Classify each taxable event as short-term (≤1 year) or long-term (&gt;1 year) for rate purposes.Step 3: Calculate capital gains and lossesFor taxable sales or trades:Formula: Proceeds (FMV at disposal) - Cost Basis = Gain/LossExample: Bought 1 Ether (ETH) for $2,000 in May 2024, sold for $2,500 in November 2024 = $500 short-term gain.Use first-in, first-out or specific identification for cost basis (be consistent). Sum your net gains/losses. See the “2024 Federal Income Tax Brackets” section for how these are taxed.Step 4: Calculate crypto incomeFor earnings (mining, staking, airdrops):Record FMV in USD when received (e.g., 10 Cardano worth $5 on June 1, 2024 = $5 income).Add to your other 2024 income to set your tax bracket, detailed in the sections above.Step 5: Apply the 2024 standard deductionLower your taxable income with the standard deduction:Single: $14,600Married filing jointly: $29,200Head of household: $21,900Subtract this from total income (including short-term gains and crypto income). Long-term gains are taxed separately.Step 6: Determine your tax ratesApply rates to your gains and income (refer to “How Crypto Tax Rates Work in 2024”):Short-term gains and income: Ordinary rates (10%–37%).Long-term gains: 0%, 15% or 20%, based on income.Offset gains with losses (up to $3,000 net loss against other income; carry forward excess).Step 7: Complete the necessary tax formsFill out the required IRS forms (see “Essential Forms for Filing Crypto Taxes in 2024”):List capital gains/losses and income on Form 8949, Schedule D and Schedule 1 as applicable.Use Schedule C if self-employed (e.g., mining business).Combine everything on Form 1040.Check Form 1099-MISC if received and file FBAR for foreign accounts over $10,000.Step 8: File your return by April 15, 2025Submit via IRS e-file or mail, postmarked by April 15, 2025. Need more time? File Form 4868 for an extension to Oct. 15, 2025, but pay estimated taxes by April 15 to avoid penalties.Step 9: Pay any taxes owedEstimate your tax from Step 6, then pay via IRS Direct Pay or check. Late payments after April 15 incur a 0.5% monthly penalty plus interest.Step 10: Keep records for auditsStore transaction records and forms for three to six years. The IRS is intensifying crypto scrutiny — be prepared.Did you know? In Canada, giving cryptocurrency as a gift is generally considered a taxable disposition, requiring the giver to determine and report any capital gains or losses.Important dates and deadlines for 2024–2025 tax season and beyond Here are important dates regarding the 2024–2025 tax season and 2025 transition:2024 tax seasonJan. 31, 2025: Some exchanges may issue voluntary 1099s (e.g., 1099-MISC).April 15, 2025: File taxes on crypto earned in 2024.2025 transitionJan. 1, 2025: Form 1099-DA reporting begins.Dec. 31, 2025: Safe harbor ends for adjusting universal cost basis.Jan. 31, 2026: Receive Form 1099-DA for 2025 trades.Quarterly estimatesJune 15, Sept. 15, 2025, etc., for active traders.New IRS crypto tax rules for 2025: What you need to knowThe IRS introduced new rules for tax filing and reporting aimed at US cryptocurrency taxpayers, but these regulations have encountered significant pushback. Both the US Senate and House of Representatives voted to repeal them under the Congressional Review Act (CRA), and President Donald Trump has signaled support for the rollback. Despite this uncertainty, understanding these rules remains crucial, especially with deadlines looming in 2025.A core component of the new rules is calculating taxes using a cost basis — the original amount invested in an asset, including fees or commissions. Accurately tracking cost basis is vital for proper tax reporting and prevents double taxation on reinvested earnings. It’s the starting point for determining capital gains or losses. Under the updated IRS guidelines, crypto investors must now track the cost basis (original purchase price) separately for each account or wallet, moving away from a universal tracking approach. This requires recording the purchase date, acquisition cost and specific transaction details.The rules also mandate specific identification for every digital asset sale, requiring taxpayers to report the exact purchase date, quantity and cost of the assets sold. If this information isn’t provided, the IRS defaults to the first-in, first-out (FIFO) method — selling your earliest coins first — which could inflate taxable gains if those initial purchases had lower costs. For taxpayers previously using a universal cost basis method, the IRS requires reallocating their basis across all accounts or wallets accurately by Dec. 31, 2025, to comply with these standards.Form 1099-DA: What to expect for crypto taxes in 2025–2026As of March 27, 2025, Form 1099-DA is set to become a pivotal tool for the 2025–2026 tax season, simplifying how cryptocurrency transactions are reported in the US. This new form, tailored specifically for digital assets, will be issued by exchanges to both taxpayers and the IRS, providing a detailed breakdown of activities like sales, trades and other taxable crypto events from 2025. It’s designed to streamline compliance and bolster IRS oversight, reflecting the agency’s growing focus on tracking digital asset income. For taxpayers, it promises easier, more accurate reporting, while exchanges take on a larger role in tax documentation. For the 2024 tax year — due by April 15, 2025 — this form isn’t yet available; filers must still rely on existing forms like Form 1099-MISC until Form 1099-DA officially takes effect for 2025 earnings.IRS crypto tax penalties: What happens if you don’t report or under-report in 2024?US taxpayers who fail to meet their tax obligations may face penalties from the IRS. When tax obligations go unmet, the IRS sends a notice or letter detailing the penalty, its reason (e.g., late filing, non-payment or inaccurate reporting) and your next steps. Penalties vary: Late filing or non-payment can incur fines up to 25% of the unpaid tax, plus interest that accrues until settled. Other triggers — like bounced checks or fraudulent claims — add further costs, and the IRS may launch an audit to scrutinize your filings.Individuals may face penalties of up to $100,000 and criminal sanctions, including imprisonment for up to five years. Corporations can be fined up to $500,000.These stakes are high, especially as the IRS ramps up crypto enforcement in 2024. To dodge these consequences, double-check any notice for accuracy and act fast: Request a filing extension with Form 4868 if needed (due by April 15, 2025), arrange a payment plan for unaffordable penalties, or dispute the penalty if you believe it’s unjustified. Prompt action can save you from escalating costs and legal headaches.","url":"https://cointelegraph.com/news/how-to-file-crypto-taxes-in-the-us?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound","date":"Unknown"},{"id":"1743422200612-16","title":"Is SOL Back? PumpSwap Slams $10Bn Volume Since Launch: Best Solana Meme Coin to Buy?","description":"Over $10 billion in cumulative volume has been processed on PumpSwap, the new decentralized exchange (DEX) from the creators of the Solana (SOL) memecoin launchpad, Pump.fun – but what are the best Solana meme coins to buy for April? Pump.fun launched its own DEX on March 20 to give a platform to its successful meme.. The post Is SOL Back? PumpSwap Slams $10Bn Volume Since Launch: Best Solana Meme Coin to Buy? appeared first on 99Bitcoins.","url":"https://99bitcoins.com/news/presales/is-sol-back-pumpswap-slams-10bn-volume-since-launch-best-solana-meme-coin-to-buy/","date":"Unknown"},{"id":"1743422200612-17","title":"Dogecoin Holds Key Support: A Demand Spike Could Trigger A Rally","description":"Dogecoin is trading around a key demand zone as the entire crypto market battles renewed selling pressure. Among the hardest-hit segments are meme coins, which have seen sharp pullbacks in recent days. Dogecoin, the original and most recognized meme token, continues to follow a persistent bearish trend — one that may not reverse unless current levels hold firm. Related Reading: Ethereum Analyst Eyes $1,200-$1,300 Level As Potential Acquisition Zone – Details Investor sentiment across the space remains cautious, with rising macroeconomic uncertainty and weakening momentum dragging prices lower. For Dogecoin, this moment is especially critical, as its price action now hovers just above the lower boundary of a long-term parallel channel. Crypto analyst Ali Martinez shared technical insights revealing that Dogecoin is still holding above this crucial support level. According to Martinez, a spike in demand from this zone could act as the launchpad for a rally toward the mid or upper range of the channel — potentially offering much-needed relief for DOGE holders. While broader market conditions remain fragile, Dogecoin’s structure suggests it still has room to rebound — but only if buyers step in soon. As price compresses near support, the next move could define the token’s short-term trend in a market filled with uncertainty. Dogecoin Down 66% As Market Uncertainty Weighs On Sentiment Dogecoin is currently trading under heavy pressure, down approximately 66% from its multi-year high near $0.48. Despite brief attempts at recovery, underwhelming price action and bearish sentiment continue to drag DOGE lower, with bulls struggling to find momentum in an increasingly volatile market. The broader macroeconomic backdrop isn’t helping either — rising interest rates, geopolitical instability, and trade war tensions have all contributed to a high-risk environment across global financial markets. This turbulence is having an outsized impact on speculative assets, and meme coins like Dogecoin remain some of the most vulnerable. The current conditions suggest that heightened volatility may become the new norm for the foreseeable future, increasing the risk of further downside for DOGE unless strong support holds. Martinez’s technical outlook on X notes that the $0.15 level is now essential for Dogecoin bulls. According to his analysis, DOGE continues to trade just above the lower boundary of a long-term bullish channel — a structure that has held firm through multiple market cycles. Martinez emphasizes that a spike in demand at this level could trigger a sharp rally, potentially pushing DOGE toward the mid or upper range of the channel, between $4 and $7. While this may seem ambitious given current sentiment, the long-term setup remains technically intact — but bulls must step in now to avoid a complete breakdown. Related Reading: Ethereum MVRV Ratio Nears 160-Day MA Crossover – Accumulation Trend Ahead? DOGE Bears Push Bulls to the Edge Dogecoin is trading at $0.16 after facing intense selling pressure over the past several days, dropping more than 20% in under a week. The sharp decline has placed bulls in a difficult position, with momentum clearly favoring the bears. The price structure remains decisively bearish, and if DOGE fails to hold the critical $0.15 support level, a dramatic collapse could follow — potentially sending the meme coin into lower demand zones not seen in months. The $0.15 mark now stands as the last line of defense for bulls, as it aligns with a key long-term support level within a broader bullish channel. Losing it would likely trigger panic selling and confirm a breakdown in market structure. However, if Dogecoin can maintain support above $0.16 and attract renewed buying interest, there’s still potential for a short-term recovery. A bounce from current levels could spark a rally toward the $0.20–$0.25 range — a zone that previously acted as strong resistance and may offer the first real test of any upward momentum. Related Reading: Bitcoin OTC Desks Are Draining – Supply Squeeze On The Horizon? With market volatility high and sentiment shaky, DOGE’s ability to hold current levels will be key to determining whether this is just another dip — or the start of something worse. Featured image from Dall-E, chart from TradingView","url":"https://www.newsbtc.com/news/dogecoin/dogecoin-holds-key-support-a-demand-spike-could-trigger-a-rally/","date":"Unknown"},{"id":"1743422200612-18","title":"Bitcoin Market Headwinds To Continue? Short-Term Holder SOPR Remain In Negative Territory","description":"The previous week was quite interesting for Bitcoin as it recovered the $88,000 mark but faced significant resistance at this level, leading to a pullback near $81,000. During this movement, BTC saw notable selling pressure from investors who sold their holdings at a loss. Persistent Negative Bitcoin Short-Term Holder SOPR Bitcoin’s bearish pressure is intensifying […]","url":"https://bitcoinist.com/bitcoin-sths-sopr-negative/","date":"Unknown"},{"id":"1743422200612-19","title":"Ethereum Price Falls Below $1,800 Despite Ending Its Spot ETF Outflow Streak","description":"Coinspeaker Ethereum Price Falls Below $1,800 Despite Ending Its Spot ETF Outflow Streak Ethereum’s bearish sentiment has strengthened while the ETH-based investment products in the US ended their four-week outflow streak. Ethereum Price Falls Below $1,800 Despite Ending Its Spot ETF Outflow Streak","url":"https://www.coinspeaker.com/ethereum-price-falls-below-1800-despite-ending-its-spot-etf-outflow-streak/","date":"Unknown"}],"timestamp":1743422200612}